import { Banner } from '@/components/ui/Banner';
import { Title } from '@/components/ui/Title';
import { type FC } from 'react';

const ExchangeReturn: FC = () => {
  return (
    <section className="md:max-w-medium w-full px-2.5 mx-auto">
      <Title
        classNameModificator="text-darkGray-100 mb-6 md:pt-8"
        titleTag={'h1'}
      >
        Обмін і повернення товару
      </Title>
      <p className="mb-1 md:mb-2">
        Згідно із Законом України "Про захист прав споживачів" покупець має
        право на заміну чи повернення товару протягом 14 днів з моменту покупки.
        Обміну чи поверненню підлягає лише новий товар, який не був у вжитку та
        не має слідів використання: подряпин, сколів, потертостей, програмне
        забезпечення не зазнавало змін тощо. Має бути збережено його товарний
        вигляд, споживчі властивості, пломби, ярлики.{' '}
      </p>
      <p className="mb-1 md:mb-2">
        Ви маєте право обміняти непродовольчий товар належної якості на
        аналогічний, якщо товар не задовольнив вас за формою, габаритами,
        кольором, розміром або з інших причин.
      </p>
      <p className="mb-1 md:mb-2">
        Для повернення або обміну товару при собі необхідно мати:
      </p>
      <ul className="list-disc list-inside">
        <li>Гарантійний талон</li>
        <li>Повну комплектацію товару</li>
        <li>Заводське впакування</li>
      </ul>
      <Banner
        size="small"
        classNameModificator="bg-yellow-90 bg-[url('https://www.svgrepo.com/show/429545/money-curreny.svg')] bg-contain bg-[90%] bg-no-repeat"
      >
        <span className="uppercase text-dispS1 md:text-dispL text-darkSkyBlue-90 font-bold">
          повернення коштів
        </span>
      </Banner>
      <p>
        Для замовлень оплачених післяплатою або банківською карткою, повернення
        коштів здійснюється на карту протягом 3-х робочих днів з моменту
        підтвердження повернення нашим менеджером. Термін зарахування коштів
        залежить від банку емітента вашої картки та може становити 3-5 робочих
        днів. Зарахування та зняття коштів згідно з тарифами Вашої картки.{' '}
      </p>
      <Banner
        size="small"
        classNameModificator="bg-green-80 bg-[url('https://www.svgrepo.com/show/110039/guarantee.svg')] bg-contain bg-[90%] bg-no-repeat"
      >
        <span className="uppercase text-dispS1 md:text-dispL text-mystic-90 font-bold">
          гарантійне
        </span>
        <span className="uppercase text-dispS1 md:text-dispL text-mystic-90 font-bold">
          обслуговування
        </span>
      </Banner>
      <p className="mb-1 md:mb-2">
        На всі пристрої Apple поширюється гарантія 12 місяців. Весь товар в
        Інтернет-магазин супроводжується гарантією магазину (інформацію про
        гарантію можна побачити в картці товару, Характеристики). Гарантія має
        на увазі під собою безкоштовний ремонт протягом гарантійного терміну у
        фірмових. сервісних центрах України та Європи, або заміну на аналогічний
        за призначенням пристрій (у разі неможливості ремонту).
      </p>
      <p className="mb-1 md:mb-2">
        Пристрій не може бути прийнятий на гарантійний ремонт у разі:
      </p>
      <ul className="list-disc list-inside">
        <li>
          наявності механічних та інших пошкоджень, що виникли внаслідок умисних
          або необережних дій покупця або третіх осіб.
        </li>
        <li>порушення правил використання, викладених виробником.</li>
        <li>
          несанкціонованого розтину, ремонту або зміни внутрішніх комунікацій та
          компонентів.
        </li>
        <li>
          ушкодження, викликаного потраплянням всередину виробу сторонніх
          предметів, речовин, рідин або дією екстремальних температур.
        </li>
      </ul>
    </section>
  );
};

export default ExchangeReturn;
