import { SectionLayout } from '@/components/layout/SectionLayout';
import { Title } from '@/components/ui/Title';
import type { FC } from 'react';

const UserAgreement: FC = () => {
  return (
    <SectionLayout classNameModificator="py-4">
      <Title classNameModificator="text-darkGray-100 mb-6" titleTag={'h1'}>
        Угода користувача
      </Title>
      <Title
        classNameModificator="mb-4 font-bold text-dispS3 md:text-dispS2"
        titleTag={'h2'}
      >
        1. Загальні умови використання Сайту.
      </Title>
      <p>
        1.1. Сайт є платформою для розміщення пропозицій щодо продажу Товарів
        Продавцями. Матеріали та послуги цього сайту надаються «як є» без
        будь-яких гарантій. Адміністрація не гарантує точності та повноти
        матеріалів, програм та послуг, що надаються на Сайті.
      </p>
      <p>
        1.2. Ця Угода є публічною офертою. Отримуючи доступ до матеріалів Сайту,
        Користувач вважається таким, що приєднався до цієї Угоди.
      </p>
      <p>
        1.3. Адміністрація Сайту має право в будь-який час в односторонньому
        порядку змінювати умови цієї Угоди. Такі зміни набирають чинності з
        моменту розміщення нової версії Угоди на сайті.
      </p>
      <p>
        1.4. Пропозиція на Сайті не є офертою. Однак, Користувач після
        ознайомлення з Пропозицією має право зробити оферту Продавцю (Продавцям)
        шляхом заповнення форми Замовлення. Заповнення форми Замовлення
        вважається офертою Користувача Продавцю (Продавцям) для придбання
        Користувачем відповідного Товару на умовах, зазначених у Пропозиції.
      </p>
      <p>
        1.5. Користувач розуміє, що його оферта перенаправляється Адміністрацією
        Продавцю, обраному Адміністрацією. Це положення не означає, що
        Адміністрація діє як агент Продавця та/або бере на себе будь-яку
        відповідальність за виконання Замовлення Продавцем.
      </p>
      <p>
        1.6. Оферта вважається прийнятою Продавцем, якщо останній здійснив дії,
        що свідчать про прийняття оферти Користувача, а саме: фактично
        відвантажив товар, розпочав надання послуг або виконання робіт
        відповідно до умов, передбачених офертою Користувача.
      </p>
      <p>
        1.7. Після отримання оферти Користувача Продавець має право
        запропонувати придбати Товар на інших умовах, ніж передбачено офертою
        Користувача. У цьому випадку така пропозиція вважається зустрічною
        офертою і має бути прийнята Користувачем. Прийняттям зустрічної оферти
        вважається фактичне отримання Користувачем (Одержувачем) Товару за умов,
        обумовлених зустрічною офертою. Продавець має право відкликати таку
        зустрічну оферту до моменту видачі товару Покупцю.
      </p>
      <p>
        1.8. Достатнім доказом прийняття оферти Продавцем або зустрічної оферти
        (тобто погодження Сторонами всіх істотних умов продажу Товару) є
        фактичне отримання та прийняття Товару Одержувачем.
      </p>
      <p>
        1.9. Не вважається прийняттям Продавцем Оферти Користувача направлення
        Продавцем та/або Адміністрацією засобами електротехнічної
        (sms-інформування, електронна пошта, телефон тощо) або іншого зв'язку
        повідомлення Продавця/Адміністрації про отримання Замовлення Користувача
        та/або про строки його отримання та/або про ціну Товару. Дане
        повідомлення є виключно повідомленням про отримання Продавцем оферти
        Користувача (але не про її прийняття) та містить відтворення умов
        оферти, наданої Користувачем.
      </p>
      <p>
        1.10. Єдиним засобом відшкодування, яке надається Користувачеві у разі
        невідповідності фактичних умов продажу оферти, є надання Користувачеві
        (Одержувачу) права відмовитися від отримання та прийняття відповідного
        Товару та вимагати повернення сплаченої за нього вартості, а також
        вартості доставки Товару до пункту видачі (якщо дані суми фактично були
        оплачені Платником). Отримувач має право скористатися цим правом до
        моменту підписання документів, що підтверджують отримання Товару (в т.ч.
        документів перевізника про доставку відправлення з Товаром Одержувачу).
      </p>
      <p>
        1.11. Моментом отримання та прийняття Товару Одержувачем є момент
        (залежно від того, який настав раніше): – підписання Одержувачем акта
        прийому-передачі Товару (або іншого рівнозначного за змістом документа,
        що підтверджує факт передачі Товару Одержувачу), або – підписання
        Одержувачем документів перевізника, що підтверджують факт отримання
        відправлення, що містив Товар, або – фактичне отримання Одержувачем
        Товару та вчинення Одержувачем дій, що свідчать про прийняття Товару
        (Одержувач отримав Товар та залишив пункт видачі товару тощо).
      </p>
      <p> 1.12. Інформація про товар.</p>
      <p>
        1.12.1. Інформація в Товарі міститься на самому Товарі, його упаковці,
        товаросупровідних документах на Товар. Інформація про товар також може
        надаватися дистанційно (по телефону шляхом розміщення інформації про
        товар на сайті). Користувач підтверджує свою згоду на отримання
        інформації про товар за допомогою засобів дистанційного зв'язку
        0800332525.
      </p>
      <p>
        1.12.2. При отриманні Товару до моменту підписання документів, що
        підтверджують отримання Товару, Отримувач зобов'язаний ознайомитися з
        інформацією про Товар, що міститься на Товарі та/або упаковці та/або у
        товаросупровідних документах. У разі необхідності отримання додаткової
        інформації про Товар Одержувач зобов'язаний зв'язатися з Продавцем та
        отримати необхідну інформацію засобами дистанційного зв'язку до моменту
        прийняття Одержувачем Товару.
      </p>
      <p>
        1.12.4. У разі зміни ціни Товару порівняно з узгодженими Сторонами
        згідно з п. 1.4. - 1.7. Угоди умовами Одержувач має право відмовитися
        від отримання та ухвалення Товару. При цьому Отримувач (Платник) має
        право вимагати повернення сплачених за Товар сум, а також сум, сплачених
        за доставку Товару Одержувачу. Будь-які інші компенсації (в т.ч.
        відшкодування збитків, неустойка та інше) – Продавцем або Адміністрацією
        не надаються.
      </p>
      <p> 1.13. Обмеження відповідальності.</p>
      <p>
        1.13.1. Сайт є платформою для розміщення пропозицій продавцями. У
        зв'язку з цим, Адміністрація (крім випадків, коли Адміністрація є
        Продавцем) не несе будь-якої відповідальності перед Користувачами
        (Платниками, Одержувачами) за виконання Замовлення Продавцями та
        пов'язані з цим питання, у тому числі, але не виключно: – за
        відповідність умов Пропозиції щодо фактичних умов продажу Товарів, за
        відсутність Товару, – за прострочення доставки Товару, – за якість
        Товару, – за належне виконання гарантійних зобов'язань Продавцями та/або
        виробниками.
      </p>
      <p>
        1.13.2. Зазначені у Пропозиції умови є попередніми умовами придбання
        Товару. Умови Пропозиції можуть змінюватись Продавцями, у тому числі
        після прийняття Замовлення до виконання. Конкретні умови продажу Товару
        Продавцями можуть визначати та змінюватись Продавцями до моменту
        передачі Товару Одержувачу.
      </p>
      <p>
        1.13.3. У разі старіння матеріалів (в т.ч. умов Пропозиції) на Сайті
        Адміністрація не зобов'язується оновлювати їх. Адміністрація за жодних
        обставин не несе відповідальності за будь-які збитки (включаючи, але не
        обмежуючись збитками від втрати прибутку, даних або від переривання
        ділової активності), що виникла внаслідок використання, неможливості
        використання або результатів використання цього Сайту.
      </p>
      <p>
        1.13.4. Відповідальність Продавця за зміни умов придбання Товару
        порівняно із зазначеними у Пропозиції обмежується тим, що Одержувач
        (Користувач, Платник) має право відмовитися від придбання Товару та
        вимагати повернення сплачених за нього коштів (якщо вони сплачені).
      </p>
      <p>
        1.13.5. У будь-якому разі сума збитків (як матеріальних, так і
        немайнових), які можуть бути виплачені Користувачеві (Платнику,
        Одержувачу) у зв'язку з порушенням його прав при використанні Сайту (в
        т.ч. у зв'язку з невиконанням Замовлення або його неналежним виконанням,
        іншими порушеннями прав Користувача) відповідно до ст. 22 Цивільного
        кодексу України обмежена сумою десять гривень.
      </p>
      <p>
        1.13.6. На Товари, на які встановлено гарантійний термін, діють
        гарантійні зобов'язання відповідно до умов, зазначених у гарантійному
        талоні та/або в інформаційних матеріалах виробника. Якщо, відповідно до
        законодавства України, на Товар має бути встановлений гарантійний строк,
        але він не встановлений виробником, гарантійний строк на такий Товар
        вважається рівним трьом дням.
      </p>
      <p>
        1.3. Користувач відповідає за достовірність даних, зазначених у формі
        Замовлення. У випадку, якщо неточна (неправильна) вказівка даних у
        Замовленні призвела до додаткових витрат Продавця, пов'язаних з
        доставкою Товару за невірною адресою або видачу Товару неналежному
        Одержувачу, всі пов'язані з цим збитки та витрати покладаються на
        Користувача. Продавець має право утримувати суму таких збитків або
        витрат із сум, сплачених Платником як оплата Товару (проводити залік
        зустрічних вимог).
      </p>
      <Title
        classNameModificator="mt-6 mb-4 font-bold text-dispS3 md:text-dispS2"
        titleTag={'h2'}
      >
        2. Зобов'язання Сторін.
      </Title>
      <p>
        2.1. Користувач зобов'язується уважно ознайомитись з цією Угодою. У разі
        незгоди з його умовами Користувач зобов'язується негайно припинити
        використання Сайту.
      </p>
      <p>
        2.2. Користувач погоджується не вдаватися до дій, які можуть
        розглядатися як такі, що порушують українське законодавство або норми
        міжнародного права, у тому числі у сфері інтелектуальної власності,
        авторських та/або суміжних правах, а також будь-яких дій, що призводять
        або можуть призвести до порушення нормальної роботи Сайту та сервісів
        Сайту.
      </p>
      <p>
        2.3. Використання матеріалів Сайту без дозволу правовласників не
        допускається. Для правомірного використання матеріалів Сайту необхідно
        укласти ліцензійні договори (отримання ліцензій) від Правовласників.
      </p>
      <p>
        2.4. При цитуванні матеріалів Сайту, включаючи авторські твори, що
        охороняються, посилання на Сайт обов'язкове.
      </p>
      <p>
        2.5. Коментарі та інші записи Користувача на Сайті не повинні суперечити
        вимогам законодавства України та загальноприйнятих норм моралі та
        моральності. Коментарі/Відгуки Користувача, розміщені на Сайті, не є
        конфіденційною інформацією та можуть бути використані Адміністрацією
        сайту без обмежень.
      </p>
      <p>
        2.6. Користувач попереджений про те, що Адміністрація Сайту не несе
        відповідальності за відвідування та використання ним зовнішніх ресурсів,
        посилання на які можуть бути розміщені на сайті.
      </p>
      <p>
        2.7. Користувач приймає положення про те, що всі матеріали та послуги
        Сайту або будь-яка їх частина можуть супроводжуватись рекламою.
        Користувач погоджується з тим, що Адміністрація Сайту не несе жодної
        відповідальності та не має жодних зобов'язань у зв'язку з такою
        рекламою.
      </p>
      <p>
        2.8. Користувач розуміє, що Продавці є окремими суб'єктами
        господарювання, які не підконтрольні Адміністрації. Користувач
        усвідомлює, що Адміністрація не має жодних повноважень щодо впливу на
        виконання Продавцями своїх зобов'язань щодо прийняття та виконання
        Замовлення, а також зобов'язань, що виникають після продажу Товару.
      </p>
      <p>
        2.9. Реєструючись на Сайті, користувач погоджуєтесь надати достовірну та
        точну інформацію про себе та свої контактні дані. В результаті
        реєстрації Ви отримуєте логін та пароль для входу до Особистого
        Кабінету, за безпеку яких Ви несете відповідальність. Ви також несете
        відповідальність за всі дії під вашим логіном та паролем на Сайті. У
        разі втрати реєстраційних даних Ви зобов'язуєтесь повідомити про це нам.
        Адміністрація сайту залишає за собою право розсилати наші акції на номер
        користувача, вказаний у замовленні. У разі відмови ми зобов'язуємося
        виключити вашу адресу з смс розсилки.
      </p>
      <p>
        2.10. Адміністрація сайту має право в односторонньому порядку анулювати
        обліковий запис (Особистий кабінет) Користувача, якщо вона не
        використовувалася більше 12 місяців календарних місяців поспіль без
        повідомлення Користувача.
      </p>
      <Title
        classNameModificator="mt-6 mb-4 font-bold text-dispS3 md:text-dispS2"
        titleTag={'h2'}
      >
        3. Персональні дані.
      </Title>
      <p>
        3.1. Оформляючи Замовлення на Сайті Користувач дає свою згоду
        Адміністрації на збирання та обробку (накопичення, зберігання,
        адаптування, поновлення, використання, розповсюдження, знеособлення та
        знищення) зазначених ним даних, а саме: прізвище, ім'я, по батькові,
        електронна пошта, телефон, адреса, з метою забезпечення реалізації
        відносин купівлі-продажу, відносин у сфері захисту прав споживачів, у
        сфері реклами та маркетингових досліджень, а також дає свою згоду на
        передачу (розповсюдження) його даних ТОВ «НОВА ПОШТА» (ЄДРПОУ 31316718),
        іншим транспортно-експедиторським та кур'єрським організаціям та іншим
        третім особам (без обмеження) на розсуд Адміністрації сайту. Це
        положення діє без обмеження терміну дії.
      </p>
      <p>
        3.2. Джерелом збору персональних даних є інформація, безпосередньо та
        добровільно надана Користувачем.
      </p>
      <p>
        3.3. Власником наданих Користувачем персональних даних є Адміністрація
        сайту.
      </p>
      <p>
        3.4 Суб'єкт персональних даних, відповідно до Закону України «Про захист
        персональних даних», має право: знати про джерела збору,
        місцезнаходження своїх персональних даних, мету їх обробки,
        місцезнаходження чи місце проживання (перебування) власника чи
        розпорядника персональних даних або дати відповідне доручення щодо
        отримання цієї інформації уповноваженим їм особам, крім випадків,
        встановлених законом; отримувати інформацію про умови надання доступу до
        персональних даних, зокрема інформацію про третіх осіб, яким передаються
        його персональні дані; доступ до своїх персональних даних; отримувати не
        пізніше ніж за тридцять календарних днів з дня надходження запиту, крім
        випадків, передбачених законом, відповідь про те, чи обробляються його
        персональні дані, а також отримувати зміст таких персональних даних;
        пред'являти мотивовану вимогу власнику персональних даних із
        запереченням проти обробки своїх персональних даних; пред'являти
        мотивовану вимогу щодо зміни чи знищення своїх персональних даних
        будь-яким власником та розпорядником персональних даних, якщо ці дані
        обробляються незаконно або є недостовірними; на захист своїх
        персональних даних від незаконної обробки та випадкової втрати,
        знищення, пошкодження у зв'язку з навмисним прихованням, ненаданням або
        несвоєчасним їх наданням, а також на захист від надання відомостей, які
        є недостовірними або ганьблять честь, гідність та ділову репутацію
        фізичної особи; звертатися зі скаргами на обробку своїх персональних
        даних до Уповноваженої особи або до суду; застосовувати засоби правового
        захисту у разі порушення законодавства щодо захисту персональних даних;
        вносити застереження щодо обмеження права на обробку своїх персональних
        даних під час надання согласія; відкликати згоду на обробку персональних
        даних; знати механізм автоматичного оброблення персональних даних; на
        захист від автоматизованого рішення, яке має для нього правові наслідки.
      </p>
      <p>
        3.5. Як і багато інших компаній, ми використовуємо технологію cookies на
        нашому сайті та за його межами. Cookies – це фрагменти інформації, які
        веб-сайт передає на жорсткий диск споживача для зберігання інформації,
        пов'язаної з веб-сайтом. Ця технологія розширює Ваші можливості
        використання Інтернету, зберігаючи Ваші пріоритети під час перегляду
        певного сайту. Технологія cookies не містить особистої інформації і не
        може жодним чином налаштовувати вашу систему або зчитувати інформацію з
        жорсткого диска. Під час перегляду сайту ми можемо розмістити cookies на
        вашому комп'ютері. Такі тимчасові cookies використовують для підрахунку
        кількості візитів на наш сайт. Вони видаляються, коли ви виходите з
        браузера. Постійні cookies можуть зберігатися на вашому комп'ютері вашим
        браузером. При реєстрації цей тип cookies повідомляє, що Ви вперше до
        нас завітали або заходили на наш сайт раніше. Cookie не містять
        персональних даних та можуть бути заблоковані Вами у будь-який момент.
        Маркери не отримують особистої інформації про Вас і не передають нам
        контактну інформацію, а також не отримують жодної інформації з вашого
        комп'ютера. Ми використовуємо cookies для визначення характеристик сайту
        та пропозицій, які Вам подобаються, щоб надати Вам більше інформації, в
        якій Ви зацікавлені. Крім того, файли cookie використовуються, щоб
        зробити веб-сайт didi.com.ua безпечним, захищеним та зручним. Файли
        cookie забезпечують підтримку функцій безпеки та запуск. Файли cookie
        також дозволяють відстежувати порушення ПОЛІТИКИ КОНФІДЕНЦІЙНОСТІ
        відвідувачами чи пристроями. Файли cookie допомагають оцінити кількість
        та частоту запитів, а також виявляти та блокувати тих відвідувачів або
        пристрої, які намагаються виконати пакетні завантаження інформації з
        веб-сайту.
      </p>
      <Title
        classNameModificator="mt-6 mb-4 font-bold text-dispS3 md:text-dispS2"
        titleTag={'h2'}
      >
        4. Інші умови.
      </Title>
      <p>
        4.1. Користувач має право призначити Одержувачем товару, що купується,
        третю особу. У цьому випадку Одержувач зобов'язаний вказати у формі
        Замовлення дані, необхідні для ідентифікації Одержувача та доставки
        товару. На відносини сторін, у разі, поширюються положення ст. 636
        Цивільного кодексу України.
      </p>
      <p>
        4.2.Для видачі Товару Одержувачу останній зобов'язаний пред'явити при
        отриманні Товару документ, що засвідчує особу (паспорт).
      </p>
      <p>
        4.3. При отриманні Товару Отримувач зобов'язаний розписатися в
        документах, що підтверджують отримання Товару.
      </p>
      <p>
        4.4. Усі можливі суперечки, що випливають із цієї Угоди або пов'язані з
        нею, підлягають вирішенню відповідно до чинного законодавства України.
      </p>
      <p>
        4.5. Ніщо в Угоді не може розумітися як встановлення між Користувачем та
        Адміністрації Сайту агентських відносин, відносин товариства, відносин
        із спільної діяльності, відносин особистого найму, або якихось інших
        відносин, які прямо не передбачені Угодою.
      </p>
      <p>
        4.6. Визнання судом будь-якого положення Угоди недійсним або таким, що
        не підлягає примусовому виконанню, не тягне за собою недійсність інших
        положень Угоди.
      </p>
      <p>
        4.7. Бездіяльність з боку Адміністрації Сайту в разі порушення будь-ким
        із Користувачів положень Угоди не позбавляє Адміністрацію Сайту права
        вжити пізніше відповідних дій на захист своїх інтересів та захист
        авторських прав на матеріали Сайту, що охороняються відповідно до
        законодавства. Користувач підтверджує, що ознайомлений з усіма пунктами
        цієї Угоди та безумовно приймає їх.
      </p>
      <p>
        4.8. Ця Угода регулюється та тлумачиться відповідно до законодавства
        України. Питання, які не врегульовані Угодою, підлягають вирішенню
        відповідно до законодавства України.
      </p>
      <p></p>
      <p></p>
      <p></p>
    </SectionLayout>
  );
};

export default UserAgreement;
